quantummongolia/industrial-iot/esp32_firmware/ushg/src/main.cpp
/*
 * ============================================================
 *  ESP32-S3-Zero Уусгал (ushg) → Firebase Realtime Database
 * ============================================================
 *
 *  Нэг RS485 шугам дээр Modbus RTU @ 9600bps :
 *    Slave 1 : SPM33 — Өтгөрүүлэгч УС     (P, E)
 *    Slave 2 : SPM33 — Уусгалтын ган УС   (P, E)
 *    Slave 3 : SPM33 — Компрессор ХС      (P, E)
 *
 *  Firebase RTDB:
 *    /energy_meters/em06/{power_kw,total_energy_kwh}
 *    /energy_meters/em07/{power_kw,total_energy_kwh}
 *    /energy_meters/em11/{power_kw,total_energy_kwh}
 *
 *  MAX485 модуль ↔ ESP32-S3-Zero холболт (1 transceiver):
 *    MAX485 RO  (Receiver Out) → ESP GPIO 4   (UART RX)
 *    MAX485 DI  (Driver In)    → ESP GPIO 5   (UART TX)
 *    MAX485 DE + RE (хооронд нь холбоно) → ESP GPIO 6  (чиглэл удирдлага)
 *    MAX485 A / B              → RS485 шугам (Slave 1, 2, 3 SPM33)
 *    MAX485 VCC / GND          → ESP 3V3 / GND
 *    GPIO 21 — WS2812 onboard RGB LED (статус)
 */

#include "secrets.h"
#include "ota.h"
#include <Arduino.h>
#include <Firebase_ESP_Client.h>
#include <WiFi.h>
#include <addons/RTDBHelper.h>
#include <addons/TokenHelper.h>
#include <esp_task_wdt.h>

// ── Modbus тохиргоо ────────────────────────────────────────────────────
namespace cfg {
constexpr uint8_t RX_PIN = 4;
constexpr uint8_t TX_PIN = 5;
constexpr uint8_t DE_RE = 6;
constexpr uint32_t BAUD = 9600;

// Slave IDs
constexpr uint8_t EM06_SLAVE = 1;  // SPM33 — Өтгөрүүлэгч УС
constexpr uint8_t EM07_SLAVE = 2;  // SPM33 — Уусгалтын ган УС
constexpr uint8_t EM11_SLAVE = 3;  // SPM33 — Компрессор ХС

// SPM33 register addresses (4xxxx - 40001 = Modbus address)
constexpr uint16_t SPM33_REG_POWER = 10;   // 40011: Total active power LINT32, ×0.1 W
constexpr uint16_t SPM33_REG_ENERGY = 25;  // 40026: Total active energy LUINT32, ×0.1 kWh
constexpr uint16_t SPM33_REG_CT_PRI = 201; // 40202: CT primary side value (1..50000)
constexpr uint8_t SPM33_CT_SEC = 5;        // SPM33 CT secondary side (5A typical)

constexpr uint32_t POLL_MS = 3000;                // Flow cycle interval (tick rate)
constexpr uint32_t TOTALIZER_INTERVAL_MS = 60000; // Totalizer cycle — 1 минут тутамд
constexpr uint32_t RX_TMO = 200;
constexpr uint32_t FRAME_GAP_MS = 10;

constexpr uint32_t WDT_TIMEOUT_S = 60;             // Watchdog timeout — supervisor-аас урт байх ёстой
constexpr uint32_t SUPERVISOR_TIMEOUT_MS = 45000;  // loop ийм удаан зогсвол → цэвэр ESP.restart()
constexpr uint32_t WIFI_RETRY_MS = 10000;
constexpr uint8_t MODBUS_RETRY = 2;
constexpr uint8_t MAX_CONSECUTIVE_FAILS = 10;
constexpr uint8_t MAX_RECOVERY_ATTEMPTS = 20;
// Connectivity watchdog: WiFi/Firebase энэ хугацаанаас удаан унавал болзолгүй
// ESP.restart() хийж сэргэнэ — while(true)+WDT-д найдахгүй сэргэлтийн гол баталгаа.
constexpr uint32_t MAX_OFFLINE_MS = 3UL * 60UL * 1000UL;  // 3 минут

// Long-running stability — flowmeter firmware-тэй ижил pattern
constexpr uint32_t MIN_FREE_HEAP_BYTES = 20480;                  // 20KB threshold
constexpr uint32_t MAX_UPTIME_MS = 24UL * 60UL * 60UL * 1000UL;  // 24 цаг
constexpr uint32_t HEAP_LOG_INTERVAL_MS = 5UL * 60UL * 1000UL;   // 5 минут тутам log
} // namespace cfg

// ── RGB STATUS LED (WS2812 GPIO 21 — Waveshare ESP32-S3-Zero onboard) ──
//   SLOW_RED — WiFi / Modbus / Firebase аль нэг нь алдсан үед удаан анивчина
//              (500ms on / 500ms off → 1 Hz).
//   pulse()  — Firebase-д амжилттай upload болгонд нэг богино ногоон импульс
//              (~120ms). Modbus poll-ийн 1 Hz ритмтэй синхрон.
namespace led {
constexpr uint8_t PIN = 21;
constexpr uint8_t BRIGHTNESS = 60;
constexpr uint16_t SLOW_ON_MS = 500;
constexpr uint16_t SLOW_OFF_MS = 500;
constexpr uint16_t PULSE_MS = 120;

inline void writeRGB(uint8_t r, uint8_t g, uint8_t b) {
  // Энэ board-ийн WS2812 чип нь R/G сувгуудыг солиод эмиттэр-лж байна
  // (rgbLedWrite-ийн GRB conversion нь зарим S3-Zero batch-д таарахгүй).
  // Тиймээс r ба g-г солиод дамжуулна — дуудлагын талд "red"/"green" хэвээр.
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
  rgbLedWrite(PIN, g, r, b);
#else
  neopixelWrite(PIN, g, r, b);
#endif
}

inline uint8_t scale(uint8_t v) { return (uint16_t(v) * BRIGHTNESS) / 255; }

enum Mode { OFF, SLOW_RED };
// Boot үед өгөгдөл хараахан явуулаагүй учир улаан анивчиж эхэлнэ.
// Эхний амжилттай upload-аас хойш OFF болж ногоон pulse-ээр л асна.
Mode mode = SLOW_RED;
unsigned long nextToggle = 0;
unsigned long pulseOffAt = 0;
bool on = false;

void begin() { writeRGB(0, 0, 0); }

void setMode(Mode m) {
  if (m == mode)
    return;
  mode = m;
  on = false;
  nextToggle = millis();
  if (m == OFF)
    writeRGB(0, 0, 0);
}

// One-shot green pulse — амжилттай upload болгонд дуудагдана.
void pulse() {
  pulseOffAt = millis() + PULSE_MS;
  writeRGB(0, scale(255), 0);
}

void update() {
  unsigned long now = millis();

  if (pulseOffAt) {
    if (now < pulseOffAt)
      return;
    pulseOffAt = 0;
    writeRGB(0, 0, 0);
    on = false;
    nextToggle = now;
  }

  if (mode == OFF)
    return;

  if (now < nextToggle)
    return;
  if (on) {
    writeRGB(0, 0, 0);
    on = false;
    nextToggle = now + SLOW_OFF_MS;
  } else {
    writeRGB(scale(255), 0, 0); // SLOW_RED
    on = true;
    nextToggle = now + SLOW_ON_MS;
  }
}
} // namespace led

// Supervisor watchdog — loop ахиц гаргаж буйг хянана. loop нь
// cfg::SUPERVISOR_TIMEOUT_MS-ээс удаан зогсвол (Firebase/WiFi/Modbus блоклосон г.м.)
// ЦЭВЭР ESP.restart() хийнэ — Task WDT-ийн panic зам (S3+USB-CDC дээр backtrace
// хэвлэхдээ гацаж болзошгүй)-аас тойрно. Core 0 дээр тусдаа ажилладаг тул core 1-ийн
// loop бүрэн блоклосон ч энэ task ажиллана.
volatile uint32_t g_loopBeat = 0;
void watchdogTask(void *) {
  uint32_t lastBeat = 0;
  unsigned long lastChangeMs = millis();
  for (;;) {
    if (g_loopBeat != lastBeat) {
      lastBeat = g_loopBeat;
      lastChangeMs = millis();
    } else if (millis() - lastChangeMs >= cfg::SUPERVISOR_TIMEOUT_MS) {
      Serial.println("[Supervisor] loop stalled — clean ESP.restart()");
      Serial.flush();
      ESP.restart();
    }
    vTaskDelay(pdMS_TO_TICKS(1000));
  }
}

void ledTask(void *) {
  for (;;) {
    led::update();
    vTaskDelay(pdMS_TO_TICKS(20));
  }
}

// ── Modbus ─────────────────────────────────────────────────────────────
class Modbus {
public:
  void begin() {
    pinMode(cfg::DE_RE, OUTPUT);
    digitalWrite(cfg::DE_RE, LOW);
    Serial1.begin(cfg::BAUD, SERIAL_8N1, cfg::RX_PIN, cfg::TX_PIN);
  }

