quantummongolia/industrial-iot/esp32_firmware/ushg/src/main.cpp
  if (WiFi.status() != WL_CONNECTED &&
      now - lastWifiCheck >= cfg::WIFI_RETRY_MS) {
    lastWifiCheck = now;
    Serial.println("[WiFi] retry — async reconnect");
    WiFi.reconnect();
  }

  static unsigned long lastPoll = 0;
  if (now - lastPoll < cfg::POLL_MS)
    return;
  lastPoll = now;

  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("[WiFi] not connected");
    led::setMode(led::SLOW_RED);
    return;
  }

  // Boot үед уншиж чадаагүй CT primary-уудыг дахин оролдох — нэг slave/cycle.
  {
    static const uint8_t spmSlaves[3] = {cfg::EM06_SLAVE, cfg::EM07_SLAVE, cfg::EM11_SLAVE};
    for (uint8_t s : spmSlaves) {
      if (!ctPrimaryKnown[s]) {
        Spm33_readCtPrimary(modbus, s);
        delay(cfg::FRAME_GAP_MS);
        break; // зөвхөн нэгийг л оролдоно
      }
    }
  }

  // Цикл бүрд flow-cycle (power) эсвэл totalizer-cycle (energy) гэсэн 2 төрлийн
  // нэг нь явна. RS485 bus-н ачааллыг бууруулж, energy-г тусад нь 1 минутын циклд
  // уншина. Boot-ийн дараа нэг удаа energy-г шууд уншиж cache-г бөглөнө.
  bool totalizerCycle = (lastTotalizerReadTime == 0) ||
                        (now - lastTotalizerReadTime >= cfg::TOTALIZER_INTERVAL_MS);

  Spm33Reading em06, em07, em11;

  if (totalizerCycle) {
    // ── Totalizer cycle: EM06 + EM07 + EM11 энерги
    lastTotalizerReadTime = now;
    Serial.println("[Cycle] Totalizer read (1 min interval)");

    em06 = Spm33_readEnergy(modbus, cfg::EM06_SLAVE);
    if (em06.energyOk) { cachedEm06EnergyKWh = em06.energyKWh; cachedEm06EnergyValid = true; }
    delay(cfg::FRAME_GAP_MS);

    em07 = Spm33_readEnergy(modbus, cfg::EM07_SLAVE);
    if (em07.energyOk) { cachedEm07EnergyKWh = em07.energyKWh; cachedEm07EnergyValid = true; }
    delay(cfg::FRAME_GAP_MS);

    em11 = Spm33_readEnergy(modbus, cfg::EM11_SLAVE);
    if (em11.energyOk) { cachedEm11EnergyKWh = em11.energyKWh; cachedEm11EnergyValid = true; }
    delay(cfg::FRAME_GAP_MS);

    Serial.printf("[Totalizer] EM06:%s EM07:%s EM11:%s\n",
                  em06.energyOk ? String(em06.energyKWh, 1).c_str() : "#",
                  em07.energyOk ? String(em07.energyKWh, 1).c_str() : "#",
                  em11.energyOk ? String(em11.energyKWh, 1).c_str() : "#");
  } else {
    // ── Flow cycle: EM06 + EM07 + EM11 power
    em06 = Spm33_readPower(modbus, cfg::EM06_SLAVE);
    delay(cfg::FRAME_GAP_MS);
    em07 = Spm33_readPower(modbus, cfg::EM07_SLAVE);
    delay(cfg::FRAME_GAP_MS);
    em11 = Spm33_readPower(modbus, cfg::EM11_SLAVE);
    delay(cfg::FRAME_GAP_MS);

    Serial.printf("[Flow] EM06:%s EM07:%s EM11:%s\n",
                  em06.powerOk ? String(em06.powerKW, 2).c_str() : "#",
                  em07.powerOk ? String(em07.powerKW, 2).c_str() : "#",
                  em11.powerOk ? String(em11.powerKW, 2).c_str() : "#");
  }

  // ── Алдаа escalate ──────────────────────────────────────────────
  bool anyOk = em06.powerOk || em06.energyOk || em07.powerOk || em07.energyOk ||
               em11.powerOk || em11.energyOk;
  if (anyOk) {
    consecutiveReadFails = 0;
    totalRecoveryAttempts = 0;
  } else {
    consecutiveReadFails++;
    if (consecutiveReadFails >= cfg::MAX_CONSECUTIVE_FAILS)
      recoverModbusBus();
  }

  // ── Firebase upload — /energy_meters subtree-г жижиг updateNode-оор бичнэ.
  if (!fbCanUpload()) {
    led::setMode(led::SLOW_RED);
    return;
  }
  if (!Firebase.ready()) {
    led::setMode(led::SLOW_RED);
    return;
  }
  if (!firebaseReady) {
    firebaseReady = true;
    Serial.println("[Firebase] ready");
    ota::begin(&fbData);  // DEVICE_ID register + командын stream нээх
  }

  // ─ /energy_meters/{em06,em07} ──────────────────────────────────────
  // Flow cycle: power_kw (instantaneous)
  // Totalizer cycle: total_energy_kwh (cumulative)
  bool emOk = true;
  bool emAny = false;
  {
    FirebaseJson j;
    auto addEm = [&](const char *id, const Spm33Reading &r, LiveState &lv) {
      String base = String(id) + "/";
      if (totalizerCycle) {
        if (r.energyOk) {
          j.set((base + "total_energy_kwh").c_str(), r.energyKWh);
          emAny = true;
        }
      } else {
        if (r.powerOk) {
          j.set((base + "power_kw").c_str(), liveValue(r.powerKW, lv));
          emAny = true;
        }
      }
    };
    addEm("em06", em06, lvEm06);
    addEm("em07", em07, lvEm07);
    addEm("em11", em11, lvEm11);
    if (emAny) {
      emOk = Firebase.RTDB.updateNodeSilent(&fbData, "/energy_meters", &j);
      if (!emOk)
        Serial.printf("[Firebase] /energy_meters ERROR: %s\n",
                      fbData.errorReason().c_str());
    }
  }

  if (!emAny) {
    led::setMode(led::SLOW_RED);
    return;
  }

  if (emOk) {
    Serial.println("[Firebase] Updated");
    fbOnSuccess();
    led::setMode(led::OFF);
    led::pulse();
  } else {
    fbOnFailure();
    led::setMode(led::SLOW_RED);
  }

  // OTA heartbeat + self-test gate (амжилттай upload бүрд +1)
  ota::loop(&fbData, emOk);
}
